In [1]:
#creating data frame
import pandas as pd

data={'Name':['John','Sunath','Kisho','Leon','Itachi'],
      'Age':[21,24,24,22,16],
      'Location':['USA','SL',"SL",'JAPAN','JAPAN']
     }

In [2]:
data_set=pd.DataFrame(data)

In [8]:
data_set.head()

     Name  Age Location
0    John   21      USA
1  Sunath   24       SL
2   Kisho   24       SL
3    Leon   22    JAPAN
4  Itachi   16    JAPAN

In [10]:
print(data_set)

     Name  Age Location
0    John   21      USA
1  Sunath   24       SL
2   Kisho   24       SL
3    Leon   22    JAPAN
4  Itachi   16    JAPAN

In [5]:
#creating second table
data2={'StudentID':['001','002','003','004'],
      'Name':['Kumar','Ravi','Priya','Anjali'],
      'Age':[20,21,22,19],
      'Gender':['Male','Male','Female','Female'],
      'GPA':[3.8,3.5,3.6,3.8]
      }

In [6]:
dataset2=pd.DataFrame(data2)

In [7]:
dataset2.head()

  StudentID    Name  Age  Gender  GPA
0       001   Kumar   20    Male  3.8
1       002    Ravi   21    Male  3.5
2       003   Priya   22  Female  3.6
3       004  Anjali   19  Female  3.8

In [15]:
age_greater_30=dataset2[dataset2['Age']>20]
print(age_greater_30)

  StudentID   Name  Age  Gender  GPA
1       002   Ravi   21    Male  3.5
2       003  Priya   22  Female  3.6

In [17]:
gpa_high=dataset2[dataset2['GPA']>3.7]
gpa_high

  StudentID    Name  Age  Gender  GPA
0       001   Kumar   20    Male  3.8
3       004  Anjali   19  Female  3.8